Revit 2027 API
ExternalFileReference Properties
The ExternalFileReference type exposes the following members.
Properties
Name | Description
ExternalFileReferenceType |  The type of external file which this object references.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
PathType |  The path type of the link (relative, absolute, or server).
Top
See Also
Reference
ExternalFileReference Class
Autodesk.Revit.DB Namespace